{"links": {"self": {"href": "data/repositories/ignitionrobotics/ign-gazebo/pullrequests/18/comments/73095414.json"}, "html": {"href": "#!/ignitionrobotics/ign-gazebo/pull-requests/18/_/diff#comment-73095414"}}, "parent": {"id": 73041998, "links": {"self": {"href": "data/repositories/ignitionrobotics/ign-gazebo/pullrequests/18/comments/73041998.json"}, "html": {"href": "#!/ignitionrobotics/ign-gazebo/pull-requests/18/_/diff#comment-73041998"}}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 18, "links": {"self": {"href": "data/repositories/ignitionrobotics/ign-gazebo/pullrequests/18.json"}, "html": {"href": "#!/ignitionrobotics/ign-gazebo/pull-requests/18"}}, "title": "Implementation of System Plugins"}, "content": {"raw": "That all sounds like a good start.\n\nOne thing to consider: Do we make a distinction between input and output with respect to the ECS state? Because if input and output are both rolled into the state, then GUI would qualify as a modifying system if it’s able to send commands to the physics engine \\(or to other systems\\) through the ECS state.\n\nI suspect at some point what we’ll need is a way to allow users to configure the execution order of systems, possibly by specifying it in a new version of SDF. That’ll be important for ensuring that controllers do their update after the physics engine \\(or potentially _before_ the physics engine, depending on the nature of the controller\\). But that would take some heavy lifting and isn’t immediately necessary, so in the meantime a distinction between modifying vs non-modifying systems should get us most of what we need.", "markup": "markdown", "html": "<p>That all sounds like a good start.</p>\n<p>One thing to consider: Do we make a distinction between input and output with respect to the ECS state? Because if input and output are both rolled into the state, then GUI would qualify as a modifying system if it’s able to send commands to the physics engine (or to other systems) through the ECS state.</p>\n<p>I suspect at some point what we’ll need is a way to allow users to configure the execution order of systems, possibly by specifying it in a new version of SDF. That’ll be important for ensuring that controllers do their update after the physics engine (or potentially <em>before</em> the physics engine, depending on the nature of the controller). But that would take some heavy lifting and isn’t immediately necessary, so in the meantime a distinction between modifying vs non-modifying systems should get us most of what we need.</p>", "type": "rendered"}, "created_on": "2018-08-16T01:53:00.158405+00:00", "user": {"display_name": "Michael Grey", "uuid": "{c1cdfe52-2887-474c-ae99-72fdc53a59c9}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7Bc1cdfe52-2887-474c-ae99-72fdc53a59c9%7D"}, "html": {"href": "https://bitbucket.org/%7Bc1cdfe52-2887-474c-ae99-72fdc53a59c9%7D/"}, "avatar": {"href": "https://avatar-management--avatars.us-west-2.prod.public.atl-paas.net/557058:67759e29-d1df-465f-868d-047738e36fc9/d42d74cf-c1bd-4431-8288-07f543bbe325/128"}}, "nickname": "mxgrey", "type": "user", "account_id": "557058:67759e29-d1df-465f-868d-047738e36fc9"}, "updated_on": "2018-08-16T01:53:00.164913+00:00", "type": "pullrequest_comment", "id": 73095414}