{"links": {"self": {"href": "data/repositories/ignitionrobotics/ign-physics/pullrequests/46/comments/99586835.json"}, "html": {"href": "#!/ignitionrobotics/ign-physics/pull-requests/46/_/diff#comment-99586835"}}, "parent": {"id": 99585653, "links": {"self": {"href": "data/repositories/ignitionrobotics/ign-physics/pullrequests/46/comments/99585653.json"}, "html": {"href": "#!/ignitionrobotics/ign-physics/pull-requests/46/_/diff#comment-99585653"}}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 46, "links": {"self": {"href": "data/repositories/ignitionrobotics/ign-physics/pullrequests/46.json"}, "html": {"href": "#!/ignitionrobotics/ign-physics/pull-requests/46"}}, "title": "[WIP] Add Link features"}, "content": {"raw": "Right, I had this concern in mind when proposing `FreeGroup`. The aim is to unify the concept for both generalized and maximal coordinate representations in a way that behaves intuitively.\n\nThe key problem that resulted in [issue 2111](https://bitbucket.org/osrf/gazebo/pull-requests/2598/fix2111/diff#comment-49451934) was that it allowed a single body to be moved irrespective of its constraints, potentially making its velocity \\(and the velocities of the bodies attached to it\\) physically invalid. To cope with this, some velocities were set to zero, since zero relative velocity is always physically valid.\n\nIf a `FreeGroup` exists within a model, then the pose of that collection of links can always be modified \\(uniformly across all links in the group\\) without having a detrimental impact on the velocities of any of the bodies. Similarly, the velocity of the group as a whole can be changed without invalidating any poses.\n\nEssentially `FreeGroup` is a blackbox for an unconstrained envelope of links. Those links may have constraints inside of the envelope, but from an outside perspective the group as a whole is unconstrained. So the `FreeGroup` is free to have an intuitive API without unexpected side effects.", "markup": "markdown", "html": "<p>Right, I had this concern in mind when proposing <code>FreeGroup</code>. The aim is to unify the concept for both generalized and maximal coordinate representations in a way that behaves intuitively.</p>\n<p>The key problem that resulted in <a data-is-external-link=\"true\" href=\"https://bitbucket.org/osrf/gazebo/pull-requests/2598/fix2111/diff#comment-49451934\" rel=\"nofollow\">issue 2111</a> was that it allowed a single body to be moved irrespective of its constraints, potentially making its velocity (and the velocities of the bodies attached to it) physically invalid. To cope with this, some velocities were set to zero, since zero relative velocity is always physically valid.</p>\n<p>If a <code>FreeGroup</code> exists within a model, then the pose of that collection of links can always be modified (uniformly across all links in the group) without having a detrimental impact on the velocities of any of the bodies. Similarly, the velocity of the group as a whole can be changed without invalidating any poses.</p>\n<p>Essentially <code>FreeGroup</code> is a blackbox for an unconstrained envelope of links. Those links may have constraints inside of the envelope, but from an outside perspective the group as a whole is unconstrained. So the <code>FreeGroup</code> is free to have an intuitive API without unexpected side effects.</p>", "type": "rendered"}, "created_on": "2019-04-23T05:17:04.417571+00:00", "user": {"display_name": "Michael Grey", "uuid": "{c1cdfe52-2887-474c-ae99-72fdc53a59c9}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7Bc1cdfe52-2887-474c-ae99-72fdc53a59c9%7D"}, "html": {"href": "https://bitbucket.org/%7Bc1cdfe52-2887-474c-ae99-72fdc53a59c9%7D/"}, "avatar": {"href": "https://avatar-management--avatars.us-west-2.prod.public.atl-paas.net/557058:67759e29-d1df-465f-868d-047738e36fc9/d42d74cf-c1bd-4431-8288-07f543bbe325/128"}}, "nickname": "mxgrey", "type": "user", "account_id": "557058:67759e29-d1df-465f-868d-047738e36fc9"}, "updated_on": "2019-04-23T05:17:04.433961+00:00", "type": "pullrequest_comment", "id": 99586835}