{"links": {"self": {"href": "data/repositories/ignitionrobotics/ign-tools/pullrequests/7/comments/92177569.json"}, "html": {"href": "#!/ignitionrobotics/ign-tools/pull-requests/7/_/diff#comment-92177569"}}, "parent": {"id": 92173663, "links": {"self": {"href": "data/repositories/ignitionrobotics/ign-tools/pullrequests/7/comments/92173663.json"}, "html": {"href": "#!/ignitionrobotics/ign-tools/pull-requests/7/_/diff#comment-92173663"}}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 7, "links": {"self": {"href": "data/repositories/ignitionrobotics/ign-tools/pullrequests/7.json"}, "html": {"href": "#!/ignitionrobotics/ign-tools/pull-requests/7"}}, "title": "Adding exec launch to tools"}, "content": {"raw": "> there is a significant amount of conceptual overlap with the existing code\n\nI guess my confusion comes from my lack of understanding of the role of the `launch` component. I understand it is meant to perform process management, while `ign-tools` provides a unified command line tool. Is this correct?\n\nThis PR integrates the new component without touching the existing code, which leads me to believe that the new component is just one more consumer of `ign-tools`.  I'm probably missing some important point, a high level overview of the new functionality may help clarify things.\n\n> I prefer to limit the number of repositories, and ign-tools has CI and release procedures in place\n\nIn the past, we've \"dumped\" such new functionality into `ign-common`. However, I'm personally not a fan of bundling unrelated features together just not to make new libraries. Is the creation of a new library such an extra overhead at this point? The addition of `ign-plugin` for example has been straight-forward as far as I can tell; but again, I may be missing some important detail.\n\n---\n\n`ign-tools` has probably been the most stable of all Ignition libraries, which is reflected in the fact that it still is in version 0. I fear that tying this new functionality to the existing code will force new releases and updates without a real need.\n", "markup": "markdown", "html": "<blockquote>\n<p>there is a significant amount of conceptual overlap with the existing code</p>\n</blockquote>\n<p>I guess my confusion comes from my lack of understanding of the role of the <code>launch</code> component. I understand it is meant to perform process management, while <code>ign-tools</code> provides a unified command line tool. Is this correct?</p>\n<p>This PR integrates the new component without touching the existing code, which leads me to believe that the new component is just one more consumer of <code>ign-tools</code>.  I'm probably missing some important point, a high level overview of the new functionality may help clarify things.</p>\n<blockquote>\n<p>I prefer to limit the number of repositories, and ign-tools has CI and release procedures in place</p>\n</blockquote>\n<p>In the past, we've \"dumped\" such new functionality into <code>ign-common</code>. However, I'm personally not a fan of bundling unrelated features together just not to make new libraries. Is the creation of a new library such an extra overhead at this point? The addition of <code>ign-plugin</code> for example has been straight-forward as far as I can tell; but again, I may be missing some important detail.</p>\n<hr />\n<p><code>ign-tools</code> has probably been the most stable of all Ignition libraries, which is reflected in the fact that it still is in version 0. I fear that tying this new functionality to the existing code will force new releases and updates without a real need.</p>", "type": "rendered"}, "created_on": "2019-02-19T20:24:17.823356+00:00", "user": {"display_name": "Louise Poubel", "uuid": "{5cfa2075-477b-4ded-bdb9-8d2479544ec4}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B5cfa2075-477b-4ded-bdb9-8d2479544ec4%7D"}, "html": {"href": "https://bitbucket.org/%7B5cfa2075-477b-4ded-bdb9-8d2479544ec4%7D/"}, "avatar": {"href": "https://avatar-management--avatars.us-west-2.prod.public.atl-paas.net/557058:6ff86fcb-b7ab-44a5-b8a6-f6d9cae8b6e8/7d903d90-c5ea-4182-b7ef-0d467e9e1c74/128"}}, "nickname": "chapulina", "type": "user", "account_id": "557058:6ff86fcb-b7ab-44a5-b8a6-f6d9cae8b6e8"}, "updated_on": "2019-02-19T20:24:17.835340+00:00", "type": "pullrequest_comment", "id": 92177569}