{"links": {"self": {"href": "data/repositories/ignitionrobotics/ign-physics/pullrequests/26/comments/70859928.json"}, "html": {"href": "#!/ignitionrobotics/ign-physics/pull-requests/26/_/diff#comment-70859928"}}, "parent": {"id": 70856345, "links": {"self": {"href": "data/repositories/ignitionrobotics/ign-physics/pullrequests/26/comments/70856345.json"}, "html": {"href": "#!/ignitionrobotics/ign-physics/pull-requests/26/_/diff#comment-70856345"}}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 26, "links": {"self": {"href": "data/repositories/ignitionrobotics/ign-physics/pullrequests/26.json"}, "html": {"href": "#!/ignitionrobotics/ign-physics/pull-requests/26"}}, "title": "Feature System Part 2: Frame Semantics"}, "content": {"raw": "If truly generalized support for physics engines is a priority, then Eigen \\(or perhaps something functionally equivalent\\) should be as well.\n\nIf we don’t adopt Eigen or something equivalent now, then our only option will be to redo the entire `ign-physics` design and implementation right now to accommodate `ign-math`'s inherent design limitations. Then in the future if we decide that we do actually want fully generalized support for physics engines, we'll have to throw away everything we did to accommodate `ign-math` and come back to where we are right now and develop from there.\n\nWhat specifically is the cost of adopting Eigen? It's readily available on all platforms that we support \\(and even if it weren't, we can drop its headers into our own repo\\). It provides a lot of features that accelerate our ability to develop useful code. It provides users with much richer features. It reduces the amount of maintenance we need to perform. If we make some implicit conversion functions, the transition to using it will be completely painless \\(even less painful than the transition from `gazebo::math` to `ignition::math`\\). Even if it’s not a priority, it’s exceedingly helpful for accomplishing our priorities, and without any perceivable cost. So I’m very unclear on why it seems to be getting dismissed.", "markup": "markdown", "html": "<p>If truly generalized support for physics engines is a priority, then Eigen (or perhaps something functionally equivalent) should be as well.</p>\n<p>If we don’t adopt Eigen or something equivalent now, then our only option will be to redo the entire <code>ign-physics</code> design and implementation right now to accommodate <code>ign-math</code>'s inherent design limitations. Then in the future if we decide that we do actually want fully generalized support for physics engines, we'll have to throw away everything we did to accommodate <code>ign-math</code> and come back to where we are right now and develop from there.</p>\n<p>What specifically is the cost of adopting Eigen? It's readily available on all platforms that we support (and even if it weren't, we can drop its headers into our own repo). It provides a lot of features that accelerate our ability to develop useful code. It provides users with much richer features. It reduces the amount of maintenance we need to perform. If we make some implicit conversion functions, the transition to using it will be completely painless (even less painful than the transition from <code>gazebo::math</code> to <code>ignition::math</code>). Even if it’s not a priority, it’s exceedingly helpful for accomplishing our priorities, and without any perceivable cost. So I’m very unclear on why it seems to be getting dismissed.</p>", "type": "rendered"}, "created_on": "2018-07-24T13:06:57.560518+00:00", "user": {"display_name": "Michael Grey", "uuid": "{c1cdfe52-2887-474c-ae99-72fdc53a59c9}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7Bc1cdfe52-2887-474c-ae99-72fdc53a59c9%7D"}, "html": {"href": "https://bitbucket.org/%7Bc1cdfe52-2887-474c-ae99-72fdc53a59c9%7D/"}, "avatar": {"href": "https://avatar-management--avatars.us-west-2.prod.public.atl-paas.net/557058:67759e29-d1df-465f-868d-047738e36fc9/d42d74cf-c1bd-4431-8288-07f543bbe325/128"}}, "nickname": "mxgrey", "type": "user", "account_id": "557058:67759e29-d1df-465f-868d-047738e36fc9"}, "updated_on": "2018-07-24T13:06:57.576502+00:00", "type": "pullrequest_comment", "id": 70859928}