{"links": {"self": {"href": "data/repositories/ignitionrobotics/ign-physics/pullrequests/102/comments/120619540.json"}, "html": {"href": "#!/ignitionrobotics/ign-physics/pull-requests/102/_/diff#comment-120619540"}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 102, "links": {"self": {"href": "data/repositories/ignitionrobotics/ign-physics/pullrequests/102.json"}, "html": {"href": "#!/ignitionrobotics/ign-physics/pull-requests/102"}}, "title": "Add DetachJointFeature and bump to 1.5.0"}, "content": {"raw": "Creating a joint between two BodyNodes that belong to two different skeletons causes one of the BodyNodes to be moved to the skeleton of the other such that the two BodyNodes are now in the same skeleton. However, detaching the two BodyNodes using `DetachJoint` does not return the BodyNodes back to their original skeletons. This means that removing a detached model in ign-gazebo would not function properly because it would either not remove all the links in the model or end up removing links that are not in the model. This is not an immediate need right now, but a potential source of unexpected behavior. I'm okay with approving this PR and putting a warning in the ign-gazebo plugin that implements attaching/detaching models.", "markup": "markdown", "html": "<p>Creating a joint between two BodyNodes that belong to two different skeletons causes one of the BodyNodes to be moved to the skeleton of the other such that the two BodyNodes are now in the same skeleton. However, detaching the two BodyNodes using <code>DetachJoint</code> does not return the BodyNodes back to their original skeletons. This means that removing a detached model in ign-gazebo would not function properly because it would either not remove all the links in the model or end up removing links that are not in the model. This is not an immediate need right now, but a potential source of unexpected behavior. I'm okay with approving this PR and putting a warning in the ign-gazebo plugin that implements attaching/detaching models.</p>", "type": "rendered"}, "created_on": "2019-10-14T15:29:17.048277+00:00", "user": {"display_name": "Addisu Z. Taddese", "uuid": "{9d7fdc68-d270-4080-bf03-4df0d0dbf635}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B9d7fdc68-d270-4080-bf03-4df0d0dbf635%7D"}, "html": {"href": "https://bitbucket.org/%7B9d7fdc68-d270-4080-bf03-4df0d0dbf635%7D/"}, "avatar": {"href": "https://avatar-management--avatars.us-west-2.prod.public.atl-paas.net/557058:90bc87b0-2886-4377-a17c-3a6629a697ff/afbf9be5-1e4c-4810-89d4-e58831f34b11/128"}}, "nickname": "azeey", "type": "user", "account_id": "557058:90bc87b0-2886-4377-a17c-3a6629a697ff"}, "updated_on": "2019-10-14T15:29:17.054583+00:00", "type": "pullrequest_comment", "id": 120619540}